Autodesk.Revit.DB.Structure.ReleaseConditions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ReleaseConditions.Mz
Gets or Sets the Mz of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.My
Gets or Sets the My of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.Mx
Gets or Sets the Mx of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.Fz
Gets or Sets the Fz of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.Fy
Gets or Sets the Fy of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.Fx
Gets or Sets the Fx of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.Start
Gets or Sets the position of release type. True for start, false for end.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Creates a new instance of ReleaseConditions.
start:
The position on analytical element. True for start, false for end.
fx:
Fx of the release type.
fy:
Fy of the release type.
fz:
Fz of the release type.
mx:
Mx of the release type.
my:
My of the release type.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions.#ctor(System.Boolean)
Creates a new instance of ReleaseConditions.
start:
The position on analytical element. True for start, false for end.
Since:
2023

Autodesk.Revit.DB.Structure.ReleaseConditions
An object that represents a Release Conditions on analytical element.
Since:
2023